In [1]:
import pandas as pd

### join:

Joins two dataframes based on their indices.
Can be used to combine data based on inner, outer, left, or right joins.
Can handle non-matching values in the indices being joined.
Can handle multiple indices being joined at once.
The resulting dataframe may have new columns and rows depending on how the join is performed.

In [2]:
left = pd.DataFrame(
    {"A": ["A0", "A1", "A2"], "B": ["B0", "B1", "B2"]}, index=["K0", "K1", "K2"]
)

In [3]:
right = pd.DataFrame(
    {"C": ["C0", "C2", "C3"], "D": ["D0", "D2", "D3"]}, index=["K0", "K2", "K3"]
)

In [4]:
left

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2

In [5]:
right

     C   D
K0  C0  D0
K2  C2  D2
K3  C3  D3

In [7]:
right.join(left) # By default how=left

     C   D    A    B
K0  C0  D0   A0   B0
K2  C2  D2   A2   B2
K3  C3  D3  NaN  NaN

In [8]:
right.join(left,how="left")  # By default how=left # how= inner/left/right/outer

     C   D    A    B
K0  C0  D0   A0   B0
K2  C2  D2   A2   B2
K3  C3  D3  NaN  NaN

In [9]:
left

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2

In [10]:
right

     C   D
K0  C0  D0
K2  C2  D2
K3  C3  D3

In [11]:
left.join(right,how='right') 
# Left_df    (right_df)

      A    B   C   D
K0   A0   B0  C0  D0
K2   A2   B2  C2  D2
K3  NaN  NaN  C3  D3

In [12]:
left.join(right,how='inner')

     A   B   C   D
K0  A0  B0  C0  D0
K2  A2  B2  C2  D2

In [14]:
left

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2

In [15]:
right

     C   D
K0  C0  D0
K2  C2  D2
K3  C3  D3

In [13]:
left.join(right,how='outer')

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

### Null / Blank values

In [16]:
Result=left.join(right,how='outer')

In [17]:
Result

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

In [18]:
Result.isna().sum()

A    1
B    1
C    1
D    1
dtype: int64

In [20]:
Result["B"].isna()

K0    False
K1    False
K2    False
K3     True
Name: B, dtype: bool

In [19]:
Result[Result["B"].isna()]

      A    B   C   D
K3  NaN  NaN  C3  D3

In [21]:
Result.isna()

        A      B      C      D
K0  False  False  False  False
K1  False  False   True   True
K2  False  False  False  False
K3   True   True  False  False

In [ ]:
Result[Result["C"].isna()]

In [22]:
Result

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

In [23]:
Result[Result["D"].isna()]

     A   B    C    D
K1  A1  B1  NaN  NaN

In [24]:
# Result.dropna()  # default axis is 0 
Result.dropna(axis=0)  # Drop rows with any null values

     A   B   C   D
K0  A0  B0  C0  D0
K2  A2  B2  C2  D2

In [ ]:
Result.dropna(axis=1)  # Drop columns with any null values

In [ ]:
Result.dropna(thresh=2)  # Drop rows where less than 2 non-null values are present

In [ ]:
Result.dropna(thresh=3)  # Drop rows where less than 3 non-null values are present